<?xml version="1.0" encoding="UTF-8"?>
<rss xmlns:atom="http://www.w3.org/2005/Atom" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:media="http://search.yahoo.com/mrss/" version="2.0">
   <channel>
      <title>Latest blog posts</title>
      <link>rss/</link>
      <description />
      <atom:link href="rss/" rel="self" />
      <language>en-us</language>
      <lastBuildDate>Mon, 24 Sep 2018 04:25:00 +0000</lastBuildDate>
      
      <item>
         <title>A quoi ressemble le web calédonien ? Les stats !</title>
         <link>a-quoi-ressemble-le-web-caledonien</link>
         <media:content medium="image" url="https://cdn.buttercms.com/SPwzL0D1S3matCZpSeOW"/>
         <dc:creator xmlns:dc="http://purl.org/dc/elements/1.1/">Guénolé Bouvet</dc:creator>
         <pubDate>Mon, 24 Sep 2018 04:25:00 +0000</pubDate>
         <guid>a-quoi-ressemble-le-web-caledonien</guid>
         <description>Même si ce nombre change tous les jours, nous avons désormais une estimation de bonne qualité du nombre de pages du web calédonien !</description>
         <content:encoded>
        <![CDATA[<h5>Date : 25/09/2018 / Auteur : G. Bouvet</h5>
<p>________________________________________</p>
<p>Au tout d&eacute;but du projet&nbsp;<a href="https://www.qwarx.nc" title="Qwarx : le moteur de recherche cal&eacute;donien">Qwarx</a>, nous nous amusions &agrave; faire des paris sur le nombre de pages que pouvait compter le web cal&eacute;donien. M&ecirc;me si ce nombre change tous les jours, nous avons d&eacute;sormais une estimation de bonne qualit&eacute;, et de nombreux autres informations tr&egrave;s int&eacute;ressantes.&nbsp;</p>
<h2>Pr&egrave;s de 700.000 pages</h2>
<p>Il existe environ 5700 sites avec un nom de domaine en ".nc". Mais ils ne sont pas tous actifs : 1600 d'entre-eux sont des sites fant&ocirc;mes (plus d'infos <a href="https://qwarx.io/blog/1600-sites-caledoniens-sont-fantomes">ici</a>). On doit y ajouter les sites en ".com", ".org", <em>etc</em>. Et Lorsqu'on cumule toutes les pages de tous les sites web cal&eacute;doniens, c'est plus de 677.000 pages que l'on peut d&eacute;couvrir... avec plus ou moins de plaisir, avouons-le.</p>
<h2>Qui trouve-t-on sur le podium ?</h2>
<p><img src="https://cdn.buttercms.com/SPwzL0D1S3matCZpSeOW" alt="" /></p>
<p>M&ecirc;me si, on le sait, ce n'est pas la quantit&eacute; qui compte mais la qualit&eacute;, les plus gros sites cal&eacute;doniens sont aujourd'hui connus. On trouve, sur la troisi&egrave;me marche, le site web du magasin l'As de Tr&egrave;fle, qui propose environ 19.000 articles en ligne. Vient ensuite, largement devant avec environ 34.000 articles, shop.nc, qui propose une solution web d'e-commerce. Et, sur la premi&egrave;re marche du podium, les pages du site web des Nouvelle-Cal&eacute;doniennes, avec environ 240.000 r&eacute;f&eacute;rences...!&nbsp;</p>
<h2>Petites annonces, e-commerce, infos : quelles proportions ?</h2>
<p>Les petites annonces (hors immobilier) se taillent une bonne part du web, avec environ 45.000 pages, r&eacute;parties sur 36 sites web diff&eacute;rents. Les annonces immobili&egrave;res occupent environ 5.300 pages (avec des doublons &eacute;videmment). Le e-commerce repr&eacute;sente pr&egrave;s de 110.000 pages, r&eacute;parties sur plus de 160 sites web. Enfin, les articles (journaux, magazine, blog, etc.) sont environ 280.000.&nbsp;</p>]]>
      </content:encoded>
      </item>
      
      <item>
         <title>Qwarx : le moteur de recherche dédié à la Nouvelle-Calédonie</title>
         <link>qwarx-le-moteur-de-recherche-dedie-a-la-nouvelle-caledonie</link>
         <media:content medium="image" url="https://cdn.buttercms.com/u0mzDSYJTVSEBWWqLs3y"/>
         <dc:creator xmlns:dc="http://purl.org/dc/elements/1.1/">Guénolé Bouvet</dc:creator>
         <pubDate>Tue, 12 Jun 2018 06:14:00 +0000</pubDate>
         <guid>qwarx-le-moteur-de-recherche-dedie-a-la-nouvelle-caledonie</guid>
         <description>Tous les professionnels du web vous le diront : la Nouvelle-Calédonie est quasiment invisible sur Google. Heureusement , Qwarx est né ! Il a l&#39;allure de Google mais il aime la Nouvelle-Calédonie Qwarx recense plus de 300.000 pages du web calédonien</description>
         <content:encoded>
        <![CDATA[<h5>Date : 4/07/2018 / Auteur : G. Bouvet</h5>
<p>________________________________________</p>
<p>Tous les professionnels du web vous le diront : la Nouvelle-Cal&eacute;donie est quasiment invisible sur Google. Heureusement , <a href="https://www.qwarx.nc" title="Qwarx : le moteur de recherche cal&eacute;donien">Qwarx</a> est n&eacute; ! Il s'agit d'un moteur de recherche, comme Google. Mais, ce Qwarx ne concerne que la Nouvelle-Cal&eacute;donie. Et &ccedil;a change tout !</p>
<p style="text-align: center;"></p>
<p style="text-align: center;"><img src="https://cdn.buttercms.com/sqbEKEJ5RU2aVGGuuPZA" alt="Qwarx est le Google cal&eacute;donien" width="888" height="383" style="display: block; margin-left: auto; margin-right: auto;" /></p>
<p style="text-align: center;"><em>Qwarx : il a l'allure de Google mais il aime la Nouvelle-Cal&eacute;donie</em></p>
<h2>Qwarx simplifie nos recherches</h2>
<p>Qwarx a &eacute;t&eacute; imagin&eacute; et programm&eacute; pour tous les <strong>internautes cal&eacute;doniens,</strong> afin de les aider &agrave; trouver ce qu'ils cherchent.</p>
<p>A la mani&egrave;re de Google ou de n'importe quel moteur de recherche,<strong> Qwarx centralise l'information.</strong> Mais Qwarx se concentre exclusivement sur les pages du web cal&eacute;donien. Elles sont plus de 350.000 !</p>
<p>Qwarx donne de la visibilit&eacute; aux sites internet locaux. Quand on cherche un objet ou un service sur Qwarx, les r&eacute;sultats de recherche ne concernent que la Nouvelle-Cal&eacute;donie. De nombreux sites internet cal&eacute;doniens sont r&eacute;f&eacute;renc&eacute;s sur Google mais n'apparaissent que tr&egrave;s loin dans le classement des r&eacute;sultats (ils sont en effet en concurrence avec des sites internationaux). Avec Qwarx, pas de souci !</p>
<h2>Toutes les petites annonces au m&ecirc;me endroit</h2>
<p>Il existe plus de 100 sites d'annonces en Nouvelle-Cal&eacute;donie... Il est donc assez fastidieux de tous les interroger. Dans le d&eacute;tails, on trouve 71 sites d'annonces immobili&egrave;res et 37 sites de petites annonces. <strong>Qwarx centralise</strong> tous ces sites et permet de tous les interroger en m&ecirc;me temps. Pratique !</p>
<h2>Tous les sites de e-commerce interrogeables au m&ecirc;me endroit</h2>
<p>De la m&ecirc;me fa&ccedil;on, Qwarx rend visible tous les sites de e-commerce cal&eacute;doniens. Ils sont 151 ! En un clin d'oeil, on peut trouver le prix et les magasins qui vendent ce qu'on cherche. C'est beaucoup plus facile de comparer. Une petite r&eacute;volution...!</p>
<h2>99% des sites cal&eacute;doniens ont &eacute;t&eacute; recens&eacute;s</h2>
<p>M&ecirc;me si toutes les pages ne figurent pas encore sur Qwarx (&ccedil;a ne saurait tarder), la quasi totalit&eacute; des sites web cal&eacute;doniens a &eacute;t&eacute; recens&eacute;e. Et le travail continue, de jour en jour, pour pr&eacute;senter aux internautes les r&eacute;sultats les plus pertinents.&nbsp;</p>
<p></p>
<p></p>]]>
      </content:encoded>
      </item>
      
      <item>
         <title>Le e-commerce calédonien est énorme... mais encore trop peu visible</title>
         <link>le-e-commerce-caledonien-est-bien-plus-developpe-quon-ne-limagine</link>
         <media:content medium="image" url="https://cdn.buttercms.com/6zqqMeKRRSJOi2xkS8UR"/>
         <dc:creator xmlns:dc="http://purl.org/dc/elements/1.1/">Guénolé Bouvet</dc:creator>
         <pubDate>Tue, 22 May 2018 07:17:00 +0000</pubDate>
         <guid>le-e-commerce-caledonien-est-bien-plus-developpe-quon-ne-limagine</guid>
         <description>Le robot de Qwarx a recensé tous les sites de e-commerce en Nouvelle-Calédonie. Et ils sont nombreux. A eux seuls, ils comptent plus de 100.000 pages ! Et ils sont plus de 170 ! Qui n&#39;a pas son e-commerce ?</description>
         <content:encoded>
        <![CDATA[<h5>Date : 21/09/2018 / Auteur : G. Bouvet</h5>
<p>________________________________________</p>
<p>Le robot de&nbsp;<a href="https://www.qwarx.nc" title="Le moteur de recherche de tous les cal&eacute;doniens">Qwarx</a> a recens&eacute; tous les sites de e-commerce en Nouvelle-Cal&eacute;donie. Et ils sont nombreux. A eux seuls, ils comptent plus de 100.000 pages ! Et ils sont plus de 170 ! Alors, pourquoi le e-commerce cal&eacute;donien reste peu visible ?</p>
<h2>Mais o&ugrave; est le e-commerce cal&eacute;donien ?</h2>
<p>O&ugrave; est le e-commerce ? Il est bien l&agrave;, mais il est peu visible. La raison est toute b&ecirc;te : le e-commerce est tributaire du bon vouloir des moteurs de recherche. Et il est particuli&egrave;rement difficile, pour un site de e-commerce cal&eacute;donien, de se faire conna&icirc;tre &agrave; moins de d&eacute;penser des sommes folles en publicit&eacute;. En effet, le moteur de recherche le plus utilis&eacute; reste Google. En termes de parts de march&eacute;, les chiffres sont clairs :</p>
<ul>
<li>Monde :&nbsp;90,6% &ndash; Bing &agrave; 3,2%, Yahoo! &agrave; 2,1%.</li>
<li>Europe : 91,6% &ndash; Bing &agrave; 3,7%, Yandex RU &agrave; 2,3%.</li>
<li>France : 91,5% &ndash; Bing &agrave; 4,9%, Yahoo! &agrave; 1,8%.</li>
</ul>
<p>Source :<span>&nbsp;</span><a title="Statcounter" href="http://gs.statcounter.com/" target="_blank" rel="noopener">StatCounter</a>&nbsp;(mai 2018)</p>
<p>Evidemment, m&ecirc;me si nous ne disposons pas de chiffre pour la Nouvelle-Cal&eacute;donie, il y a fort &agrave; parier que les r&eacute;sultats soient &eacute;galement de cet ordre de grandeur. Et le probl&egrave;me est bien l&agrave;. Le e-commerce cal&eacute;donien se bat pour appara&icirc;tre sur une plateforme qui ne le met pas en avant.</p>
<h2>170 sites, 100.000 pages, on fait comment ?</h2>
<p>Le e-commerce est pourtant bien repr&eacute;sent&eacute; et on trouve beaucoup d'articles tr&egrave;s diff&eacute;rents : alimentaires, cosm&eacute;tiques, v&ecirc;tements, technologie, etc. Il y a bien entendu <a href="https://www.shop.nc">shop.nc</a>, mais il y en a aussi d'autres ! Alors, on fait comment pour enfin trouver, en ligne, des articles vendus en Nouvelle-Cal&eacute;donie ? Eh bien Qwarx a &eacute;t&eacute; imagin&eacute; pour &ccedil;a. En effet, Qwarx centralise tous les sites de e-commerce existant en Nouvelle-Cal&eacute;donie et permet d'effectuer des recherches sur tous ces sites simultan&eacute;ment !</p>
<p><img src="https://cdn.buttercms.com/ejkCNf6gTLaCg9s9WiRe" alt="L'onglet Shopping de Qwarx.nc" width="748" height="624" /></p>
<p><em>M&ecirc;me les articles improbables peuvent &ecirc;tre facilement trouver sur Qwarx</em></p>
<p></p>]]>
      </content:encoded>
      </item>
      
      <item>
         <title>5 bonnes raisons d&#39;utiliser Qwarx.nc</title>
         <link>5-bonnes-raisons-dutiliser-qwarxnc</link>
         <media:content medium="image" url="https://cdn.buttercms.com/RJpxLQz0T92dgcqmyOxo"/>
         <dc:creator xmlns:dc="http://purl.org/dc/elements/1.1/">Guénolé Bouvet</dc:creator>
         <pubDate>Thu, 8 Feb 2018 03:13:00 +0000</pubDate>
         <guid>5-bonnes-raisons-dutiliser-qwarxnc</guid>
         <description>A bien des égards, Qwarx.nc mérite vraiment votre attention. Nous avons sélectionné pour vous 5 bonnes raisons d&#39;utiliser ce site. Raison n°1 : Qwarx est largement plus efficace que Google ! Raison n°2 : contrairement à Google, Qwarx ne vous espionne pas !</description>
         <content:encoded>
        <![CDATA[<h5>Date : 2/07/2018 / Auteur : G. Bouvet</h5>
<p>________________________________________</p>
<p>A bien des &eacute;gards, <a href="http://qwarx.nc">Qwarx.nc</a> m&eacute;rite vraiment votre attention. Nous avons s&eacute;lectionn&eacute; pour vous <strong>5 bonnes raisons d'utiliser ce moteur de recherche c&eacute;ladonien</strong>.</p>
<h2>Raison n&deg;1 : Qwarx est largement plus efficace que Google !</h2>
<p>Les sites web cal&eacute;doniens sont <strong>tr&egrave;s mal r&eacute;f&eacute;renc&eacute;s sur Google</strong>. Normal, la Nouvelle-Cal&eacute;donie est un trop petit pays. Pour Google, la Nouvelle-Cal&eacute;donie n'est qu'une petite miette. Heureusement, Qwarx permet de r&eacute;gler ce probl&egrave;me car ce moteur de recherche a &eacute;t&eacute; sp&eacute;cialement dessin&eacute; pour les petits pays, et notamment la Nouvelle-Cal&eacute;donie. Ainsi, quand on cherche "biberon", "cahier &agrave; spirales", "pharmacie de garde", <span style="text-decoration: underline;"><strong>Qwarx ne renvoie que des r&eacute;sultats qui concernent la Nouvelle-Cal&eacute;donie</strong></span>.</p>
<p style="text-align: center;"></p>
<p><img src="https://cdn.buttercms.com/xApkTYcRXeM7v7dhERGp" alt="Google n'aime pas les sites web cal&eacute;doniens. Alors que Qwarx les adore !" width="439" height="287" /></p>
<p style="text-align: left;"><em>Qwarx r&eacute;f&eacute;rence parfaitement les sites web cal&eacute;doniens</em></p>
<h2>Raison n&deg;2 : contrairement &agrave; Google, Qwarx ne vous espionne pas !</h2>
<p>Il est de notori&eacute;t&eacute; publique que Google n'est vraiment pas un exemple en mati&egrave;re de respect de la vie priv&eacute;e... Au contraire, Qwarx a &eacute;t&eacute; pens&eacute; pour la respecter parfaitement. Sur Qwarx, pas de coockie. Sur Qwarx, on ne vous espionne pas.&nbsp;</p>
<p style="text-align: center;"></p>
<p><img src="https://cdn.buttercms.com/fJ0bhlARQlK5qchL9raK" alt="Qwarx respecte la vie priv&eacute;e des internautes" width="428" height="280" /></p>
<p style="text-align: left;"><em>Google nous espionne. Ce n'est pas le cas de Qwarx !</em></p>
<h2>Raison n&deg;3 : Qwarx.nc est rapide, tr&egrave;s rapide</h2>
<p>Le moteur de recherche qui &eacute;quipe Qwarx.nc est <strong>200 fois plus rapide que les moteurs de recherche classique</strong>. Comment est-ce possible ? C'est gr&acirc;ce &agrave; une start-up fran&ccedil;aise (cocorico !). Cette start-up a mis au point un outil ultra-puissant qui a permis &agrave; la soci&eacute;t&eacute; ClacTaCom de cr&eacute;er Qwarx.nc.</p>
<p style="text-align: center;"></p>
<p><img src="https://cdn.buttercms.com/mYpSow9QbCDKQxzKYWaA" alt="Avec Qwarx.nc, les performances de vitesse sont in&eacute;gal&eacute;es" caption="true" /></p>
<p style="text-align: left;"><em>Qwarx.nc est 200 fois plus rapides que ses concurrents</em></p>
<h2>Raison n&deg;4 : il n'y a pas de publicit&eacute;&nbsp;</h2>
<p>Ah, comme c'est agr&eacute;able un site web <strong>sans pub</strong>... Plus agr&eacute;able, plus clair et plus beau ! Qwarx.nc a r&eacute;ussi &agrave; trouver le moyen d'offrir du contenu de qualit&eacute; sans utiliser la publicit&eacute;, et c'est tant mieux !</p>
<p style="text-align: center;"></p>
<p><img src="https://cdn.buttercms.com/hxzFiI7JR22m0V4A2Bet" alt="Un site web sans aucune publicit&eacute;, confort des yeux, esth&eacute;tisme" caption="true" /></p>
<p style="text-align: left;"><em>Qwarx.nc ne pr&eacute;sente aucune publicit&eacute;... ouf !</em></p>
<h2>Raison n&deg;5 : Les smartphones aiment Qwarx.nc</h2>
<p>Le site web est en <em>Progressive Web Apps</em>, le mode ultime du <strong><em>responsive design</em></strong>. Sur ordinateur, sur tablette ou sur Smartphone, le site <strong>s'affiche de fa&ccedil;on adapt&eacute;e</strong>.</p>
<p></p>
<p></p>
<p></p>]]>
      </content:encoded>
      </item>
      
      <item>
         <title>Qwarx.nc : 200 fois plus rapide qu&#39;un moteur de recherche classique</title>
         <link>moteur-recherche-qwarx-nc-rapidite</link>
         <media:content medium="image" url="https://cdn.buttercms.com/4PzP8RLIQUG13DzPfPnA"/>
         <dc:creator xmlns:dc="http://purl.org/dc/elements/1.1/">Guénolé Bouvet</dc:creator>
         <pubDate>Wed, 7 Feb 2018 07:43:00 +0000</pubDate>
         <guid>moteur-recherche-qwarx-nc-rapidite</guid>
         <description>Le moteur de recherche de Qwarx.nc fonctionne 200 fois plus vite que les moteurs de recherche classique. Mais, c&#39;est en fait tout le site web qui affiche des performance hors du commun. Un véritable confort d&#39;utilisation pour les internautes. Un guépard dans le moteur Entre 1 et 20 millisecondes, c&#39;est ...</description>
         <content:encoded>
        <![CDATA[<h5>Date : 3/07/2018 / Auteur : G. Bouvet</h5>
<p>________________________________________</p>
<p>Le <strong>moteur de recherche</strong> du site cal&eacute;donien <a href="http://qwarx.nc" title="Qwarx.nc, le moteur de recherche cal&eacute;donien">Qwarx.nc</a> fonctionne <strong>200 fois plus vite</strong> que les <strong>moteurs de recherche</strong> classiques. Mais, c'est en fait tout le site web qui affiche des performance hors du commun. Un v&eacute;ritable confort d'utilisation pour les internautes.</p>
<p><img src="https://cdn.buttercms.com/j0XNfIERfafBaqeUPuZS" alt="Le gu&eacute;part est l'animal terrestre le plus rapide, aussi rapide que Gougle.nc l'outil recherche, annuaire d'entreprise moteur de recherche ind&eacute;pendant et alternatif cal&eacute;donien qui permet le chargement rapide des pages web" caption="true" width="414" height="234" /></p>
<p style="text-align: left;"><em>Le gu&eacute;pard est l'animal terrestre le plus rapide</em></p>
<h2>Un gu&eacute;pard dans le moteur</h2>
<p>Entre 1 et 20 millisecondes, c'est le temps de r&eacute;ponse du <strong>moteur de recherche</strong> qui &eacute;quipe Qwarx.nc. Un v&eacute;ritable bolide si on le compare aux autres moteurs de recherche actuellement sur le march&eacute;. Une Start Up fran&ccedil;aise est &agrave; l'origine de ce petit miracle. L'<strong>algorithme de recherche</strong> est parfaitement optimis&eacute;.&nbsp;Cocorico !</p>
<h2>Si la r&eacute;ponse existe, on la veut tout de suite</h2>
<p>Cette <strong>vitesse</strong> repr&eacute;sente un sacr&eacute; avantage. Les internautes sont en effet de plus en plus rebut&eacute;s par des <strong>sites web</strong> qui "trainent la patte". Si le site ne s'affiche pas assez rapidement, les internautes n'y reviennent plus<sup>1</sup>. Une &eacute;tude<sup>2</sup> men&eacute;e par Google a montr&eacute; que <strong>53% des mobinautes quittent une page si elle ne se charge pas en moins de 3 secondes</strong>. Chaque seconde compte.&nbsp;Les jeunes sont exigeants et c'est logique : ils sont n&eacute;s quand le web existait d&eacute;j&agrave;. 84 % d&rsquo;entre eux pensent que la vitesse d&rsquo;affichage est primordiale, et 85 % ne recommanderaient pas un site web s'il est lent. Mais les personnes plus &acirc;g&eacute;es sont tout aussi s&eacute;v&egrave;res : chez les plus de 55 ans, 90 % ne recommanderaient pas un site s'il est lent !</p>
<h2>Les outils d'&eacute;valuation donne la note maximale &agrave; Qwarx.nc</h2>
<p>C'est suffisamment rare pour le noter et m&ecirc;me le clamer haut et fort : le moteur de recherche cal&eacute;donien gougle.nc obtient <strong>la note maximale</strong> (entre 97 et 100) sur l'outil d'&eacute;valuation <a href="https://developers.google.com/speed/pagespeed/insights/" target="_blank" rel="noopener" title="Outil d'&eacute;valuation de vitesse">Google PageSpeed Insight</a>. A titre de comparaison, un site comme Facebook se situe plut&ocirc;t aux alentours de 80.&nbsp;</p>
<p><img src="https://cdn.buttercms.com/3xcNNcNbR8OkG20xbtMp" alt="Le moteur de recherche cal&eacute;donien explose les compteurs de vitesse et re&ccedil;oit les r&eacute;compenses award des meilleurs sites web" width="550" height="226" /></p>
<p><em>Qwarx.nc explose les records de vitesse</em></p>
<p><em></em></p>
<p>Mais la vitesse ne suffit pas. L'ergonomie doit elle aussi &ecirc;tre au rendez-vous. Les sites responsive ou, encore mieux, les sites Progressive Web Apps ont largement plus de chance d'&ecirc;tre appr&eacute;ci&eacute;s. Le web mondial &eacute;volue, et les <strong>sites internet cal&eacute;doniens</strong> ne doivent pas rester sur la touche. Le niveau d'exigence monte. Les sites web, s'ils veulent survivre, doivent changer.</p>
<p>R&eacute;f&eacute;rences cit&eacute;es :</p>
<p><sup>1</sup> <a href="https://www.tube2com.com/influence-vitesse-site-taux-de-rebond/" target="_blank" rel="noopener" title="Influence de la vitesse sur le taux de rebond">https://www.tube2com.com/influence-vitesse-site-taux-de-rebond/</a></p>
<p><sup><a href="https://www.thinkwithgoogle.com/marketing-resources/data-measurement/mobile-page-speed-new-industry-benchmarks/" title="Comportement des mobinautes"></a>2</sup> <a href="https://www.thinkwithgoogle.com/marketing-resources/data-measurement/mobile-page-speed-new-industry-benchmarks/" title="Comportement internautes">https://www.thinkwithgoogle.com/marketing-resources/data-measurement/mobile-page-speed-new-industry-benchmarks/</a></p>
<p></p>]]>
      </content:encoded>
      </item>
      
      <item>
         <title>Le moteur de recherche Qwarx.nc est responsive, c&#39;est grave ?</title>
         <link>moteur-recherche-nc-qwarx-progressive-web-app</link>
         <media:content medium="image" url="https://cdn.buttercms.com/ne2lyz09ROK2Is291tDV"/>
         <dc:creator xmlns:dc="http://purl.org/dc/elements/1.1/">Guénolé Bouvet</dc:creator>
         <pubDate>Tue, 6 Feb 2018 01:17:00 +0000</pubDate>
         <guid>moteur-recherche-nc-qwarx-progressive-web-app</guid>
         <description>Le site calédonien Qwarx.nc fonctionne parfaitement sur les smartphones. Est-ce un détail ? Assurément non !</description>
         <content:encoded>
        <![CDATA[<h5>Date : 4/07/2018 / Auteur : G. Bouvet</h5>
<p>________________________________________</p>
<p>"Oh ! Comment tu parles &agrave; ta m&egrave;re ? Et arr&ecirc;te de r&eacute;pondre !" (ma m&egrave;re). R&eacute;pondre, &ccedil;a n'est pas toujours bien vu. Mais &ecirc;tre responsive, qu'en est-il exactement ? Une part grandissante des internautes consultent internet depuis leurs t&eacute;l&eacute;phones portables. Mais tous les sites internet ne sont pas "<em><strong>responsive</strong></em>". Probl&egrave;me ! Pourtant, concevoir aujourd'hui un site web en oubliant qu'il sera consult&eacute; depuis un smartphone, c'est&nbsp;un peu&nbsp;se tirer <strong>une balle dans le pied</strong>... Explications.</p>
<h2>Etre "<em>responsive design</em>" c'est grave ? Non, ce serait plut&ocirc;t l'inverse...</h2>
<p>En 2015, Google a annonc&eacute; que le nombre de recherches effectu&eacute;es sur&nbsp; t&eacute;l&eacute;phones mobiles a d&eacute;pass&eacute; le nombre de celles effectu&eacute;es depuis des ordinateurs (portables ou fixes)<sup>1</sup>. Cette tendance a &eacute;t&eacute; confirm&eacute;e en 2017 : tous sites confondus,&nbsp;les donn&eacute;es &eacute;chang&eacute;es <em>via</em> smartphones occupaient 52,64% du volume global<sup>2</sup>.&nbsp;Prendre en compte cette tendance poussent les d&eacute;veloppeurs informatiques &agrave; concevoir des sites web lisibles sur smartphone, des sites web dits&nbsp;<em>responsive</em>.</p>
<p style="text-align: center;"></p>
<p><img src="https://cdn.buttercms.com/t88bv3RXQ8eWnpeDEC2Z" alt="Qwarx.nc est un moteur de recherche destin&eacute; &agrave; la Nouvelle-Cal&eacute;donie" width="464" height="233" /></p>
<p style="text-align: left;"><em>Qwarx.nc fonctionne parfaitement sur les smartphones</em></p>
<h2>Concr&egrave;tement, &ccedil;a ressemble &agrave; quoi un site "<em>responsive</em>" ?</h2>
<p>Avec un Smartphone, il est possible de visiter n'importe quel site internet. Pouvoir visiter un site n'en fait pas pour autant un site "<em>responsive</em>". Car il ne s'agit pas d'avoir besoin de zoomer et d&eacute;zoomer sur les pages : la navigation doit &ecirc;tre facile et adapt&eacute;e aux petits &eacute;crans. Concr&egrave;tement, les pages doivent &ecirc;tre compl&egrave;tement r&eacute;organis&eacute;es, la taille de police suffisamment grande pour permettre la lecture. Si la page comporte des formulaires, ils doivent pouvoir &ecirc;tre remplis sans difficult&eacute;.</p>
<p><img src="https://cdn.buttercms.com/MjuNwAkVQomZpb32EZ6S" alt="Progressive Web Apps" caption="false" width="360" height="270" class="butter-float-left" /></p>
<h2></h2>
<h2></h2>
<h2></h2>
<h2></h2>
<h2></h2>
<h2></h2>
<h2></h2>
<h2>Quand le site web devient appli : l'exemple de Qwarx.nc</h2>
<p>D&egrave;s les d&eacute;buts du d&eacute;veloppement de <a href="http://Qwarx.nc" title="Qwarx.nc, le moteur de recherche cal&eacute;donien">Qwarx.nc</a>, ClacTaCom (la soci&eacute;t&eacute; cal&eacute;donienne &eacute;ditrice du site) a fait le choix du <em>responsive design</em>. Mais pourquoi ne pas pousser le bouchon un peu plus loin ? Pourquoi ne pas offrir une application ? Bonne id&eacute;e ! Mais il faudrait alors programmer un site web ET une application... Tout cela est bien fastidieux.&nbsp;Heureusement, il est possible aujourd'hui de <strong>r&eacute;ussir le 2-en-1</strong>. Pour Qwarx.nc, lors de la premi&egrave;re ouverture du site sur smartphone, l'utilisateur a le choix : il peut demander &agrave; utiliser le site web comme une application. Car Qwarx.nc est un site web de type<em>&nbsp;"application web progressive" ou "<strong>progressive web apps</strong>", c</em>'est-&agrave;-dire &agrave; la fois un site web et une application. Le tour est jou&eacute;.</p>
<h2>Ergonomie et vitesse d'affichage, le duo gagnant</h2>
<p>L'ergonomie d'un site web se juge aussi par ses performance en termes de rapidit&eacute;. Sur ce point, le site cal&eacute;donien Qwarx.nc n'est pas en reste. Son moteur de recherche est 200 fois plus rapide que celui de ses concurrents (Google compris).</p>
<p>Bienvenue dans le futur !</p>
<p>R&eacute;f&eacute;rences cit&eacute;es :</p>
<p><sup>1</sup><a href="https://adwords.googleblog.com/2015/05/building-for-next-moment.html" title="Building For New Moment">https://adwords.googleblog.com/2015/05/building-for-next-moment.html</a></p>
<p><sup>2</sup> <a href="https://www.statista.com/topics/779/mobile-internet/" title="Statistica">https://www.statista.com/topics/779/mobile-internet/</a></p>
<p>Illustration :&nbsp;<a href="http://www.promaticsindia.com/blog/progressive-web-apps-the-future-of-upcoming-web-development/" target="_blank" rel="noopener" title="Progressive Web Apps">http://www.promaticsindia.com/blog/progressive-web-apps-the-future-of-upcoming-web-development/</a></p>]]>
      </content:encoded>
      </item>
      
   </channel>
</rss>


